<!DOCTYPE html>
<html>
<head>

<link href="favicon.ico" rel="icon" type="image/x-icon" />

</head>

<title>Raspberry Pi - GENERALITĂȚI - RO</title>

<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="library.css">

<body>

<div class="BGtitlu">

	<div class="topTransparent"></div>
	<div class="FGdark">

		<div class="ttransparent"></div>
		<a href="mainRO.html"><img src="titlu.png"></a>

		<a href="generalRO.html"><div class="ribbonRO"><h2>RO</h2></div></a>
		<div class="triangleRO"></div>

		<a href="generalEN.html"><div class="ribbonEN"><h2>EN</h2></div></a>
		<div class="triangleEN"></div>

	</div>

</div>

<div class="BGmeniu"><div class="FGdarkmeniu">

<a href="mainRO.html"><div class="menuTab" align="center">Home</div></a>
<a href="generalRO.html"><div class="menuTabSelected" align="center">Generalit&#259;&#355;i</div></a>
<a href="istoricRO.html"><div class="menuTab" align="center">Istoric</div></a>
<a href="hardRO.html"><div class="menuTab" align="center">Hardware</div></a>
<a href="softRO.html"><div class="menuTab" align="center">Software</div></a>
<a href="useRO.html"><div class="menuTab" align="center">Utiliz&#259;ri</div></a>
<a href="contactRO.html"><div class="menuTab" align="center">Contact</div></a>

</div></div>

<div class="FGdarkcontent"><div class="ccontent2" style="color: rgb(255, 255, 255)">

	Prima genera&#539;ie de Raspberry Pi a fost lansat&#259; &#238;n februarie 2012 &#351;i a fost numit&#259; Raspberry Pi 1 Model B. A fost urmat&#259; de un model mai simplu &#351;i mai ieftin, numit Model A. &#206;n 2014, a ap&#259;rut un computer cu un design &#238;mbun&#259;t&#259;&#539;it al pl&#259;cu&#539;ei, numit Raspberry Pi 1 Model B+. Mai t&#226;rziu &#238;n acel an, modele &#238;mbun&#259;t&#259;&#539;ite numite A+ &#351;i B+ au fost lansate. Toate aceste modele au forma standard a unui card bancar.

<p>
	&#206;n noiembrie 2015, a fost lansat Raspberry Pi Zero, cu dimensiuni mai mici &#351;i cu un num&#259;r redus de intr&#259;ri &#351;i ie&#351;iri de tip I/O (input/output) &#351;i GPIO (input/output cu scop general). Pre&#539;ul acestui model este de doar 5 dolari.
</p>

<p>
	Raspberry Pi 2, cu mai mult&#259; memorie RAM, a fost lansat &#238;n februarie 2015 &#351;i Raspberry Pi 3 Model B &#238;n februarie 2016. Acesta din urm&#259; are &#238;n plus module WiFi &#351;i Bluetooth gata instalate.
</p>

<p>
	P&#226;n&#259; &#238;n acest moment (mai, 2017), Raspberry Pi 3 Model B este cel mai nou model de Raspberry din linia de produse principale, dar &#238;n 28 februarie 2017, Raspberry Pi Zero W a fost lansat, computer care este identic cu pl&#259;cu&#539;a Raspberry Pi Zero original&#259;, av&#226;nd &#238;n plus modulele WiFi &#351;i Bluetooth de pe modelul Raspberry Pi 3 Model B.
</p>


<br>
<p>
	Pre&#539;urile computerelor Raspberry variaz&#259; &#238;ntre 5 &#351;i 35 de dolari.
</p>

<p>
	Toate modelele sunt dotate cu un sistem integrat &#238;ntr-un cip (SoC) Broadcom, ce include un procesor (CPU) compatibil ARM &#351;i un procesor grafic (GPU). Vitezele CPU-ului variaz&#259; &#238;ntre 700 MHz &#351;i 1,2 GHz, iar memoria RAM &#238;ntre 256 MB &#351;i 1 GB. Carduri de memorie SD de dimensiuni SDHC sau MicroSDHC sunt folosite pentru a stoca sistemul de operare &#351;i memoria neremanent&#259;.
</p>

<p>
	Majoritatea modelelor au &#238;ntre una &#351;i patru mufe USB, output video prin HDMI &#351;i un jack de 3,5 mm pentru output audio. Output de nivel mai redus este oferit de c&#226;&#539;iva pini GPIO care suport&#259; protocoale obi&#351;nuite, precum I&#178;C. Modelele B au &#351;i un port de Ethernet 8P8C, iar Pi 3 &#351;i Pi Zero W au WiFi 802,11n &#351;i Bluetooth.
</p>

<p>
	Funda&#539;ia Raspberry pune la dispozi&#539;ie sistemul de operare Raspbian, o distribu&#539;ie Linux bazat&#259; pe Debian, dar &#351;i distribu&#539;ii de la p&#259;r&#539;i ter&#539;e, precum Ubuntu, Windows 10 IOT Core sau RISC OS, &#351;i distribu&#539;ii construite special pentru sisteme media. Python &#351;i Scratch sunt principalele limbaje de programare promovate, dar este oferit suport &#351;i pentru numeroase alte limbaje.
</p>

<br>

<p>

	<div style="text-align:center;">
	<div class="imgbox"><img src="zero.png">-Raspberry Pi Zero (2015)-</div>
</div>

</p>
</div>

<div class="bottomTransparent"></div></div>
<div class="bottomTransparent"></div>


</body>

</html>
