<!DOCTYPE html>
<html>
<head>

<link href="favicon.ico" rel="icon" type="image/x-icon" />

</head>

<title>Raspberry Pi - ISTORIC - RO</title>

<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="library.css">

<body>

<div class="BGtitlu">

	<div class="topTransparent"></div>
	<div class="FGdark">

		<div class="ttransparent"></div>
		<a href="mainRO.html"><img src="titlu.png"></a>

		<a href="istoricRO.html"><div class="ribbonRO"><h2>RO</h2></div></a>
		<div class="triangleRO"></div>

		<a href="istoricEN.html"><div class="ribbonEN"><h2>EN</h2></div></a>
		<div class="triangleEN"></div>

	</div>

</div>

<div class="BGmeniu"><div class="FGdarkmeniu">

<a href="mainRO.html"><div class="menuTab" align="center">Home</div></a>
<a href="generalRO.html"><div class="menuTab" align="center">Generalit&#259;&#355;i</div></a>
<a href="istoricRO.html"><div class="menuTabSelected" align="center">Istoric</div></a>
<a href="hardRO.html"><div class="menuTab" align="center">Hardware</div></a>
<a href="softRO.html"><div class="menuTab" align="center">Software</div></a>
<a href="useRO.html"><div class="menuTab" align="center">Utiliz&#259;ri</div></a>
<a href="contactRO.html"><div class="menuTab" align="center">Contact</div></a>

</div></div>

<div class="FGdarkcontent"><div class="ccontent2" style="color: rgb(255, 255, 255)">

	&#206;n 2006, primele concepte pentru Raspberry Pi se bazau pe microcontrollerul Atmel ATmega644. Administratorul funda&#539;iei Eben Upton a alc&#259;tuit un grup de profesori, academicieni &#537;i pasiona&#539;i de computere pentru a proiecta un computer cu scopul de a inspira copiii. Acesta este inspirat de computerul BBC Micro, dezvoltat de compania Acorn Computers &#238;n 1981. Numele Model A, Model B &#537;i Model B+ sunt referin&#539;e la modelele originale ale computerului educa&#539;ional BBC Micro. Primul prototip ARM a fost montat &#238;ntr-o carcas&#259; de dimensiunile unui stick de memorie USB, av&#226;nd la cel&#259;lalt cap&#259;t o ie&#537;ire HDMI.

	<p>
Scopul funda&#539;iei a fost s&#259; ofere dou&#259; versiuni, cu pre&#539;urile de 25 &#537;i 35 de dolari. Au &#238;nceput s&#259; primeasc&#259; comenzi pentru Model B, cel mai scump, pe 29 februarie 2012, iar pentru Model A pe 4 februarie 2013.
</p>
<br>

<h2>&#206;naintea lans&#259;rii:</h2>

<li><b>august 2011</b> - 50 de versiuni alfa ale pl&#259;cu&#539;ei sunt fabricate. Acestea sunt identice din punct de vedere func&#539;ional cu Model B ce avea s&#259; apar&#259;, dar erau fizic mai mari pentru a &#238;nc&#259;pea ie&#537;irile pentru depanare. &#206;n demonstra&#539;iile de func&#539;ionare, au fost rulate modul de desktop LXDE al sistemului de operare Debian, Quake 3 la rezolu&#539;ia 1080p &#537;i a fost redat un flux video Full HD, comprimat dup&#259; standardul MPEG-4, prin portul HDMI.
<br><br><li><b>octombrie 2011</b> - O versiune a sistemului de operare RISC OS 5 a fost demonstrat&#259; publicului.
<br><br><li><b>decembrie 2011</b> - 25 de pl&#259;cu&#539;&#259; Model B, &#238;n versiune beta, au fost asamblate &#537;i testate din 25 de pl&#259;cu&#539;e &#238;nc&#259; neasamblate. Schema componentelor a r&#259;mas aceea&#537;i &#238;n pl&#259;cu&#539;ele fabricate. O singur&#259; eroare a fost descoperit&#259; &#238;n design-ul pl&#259;cu&#539;ei, c&#226;nd anumi&#539;i pini ai procesorului nu erau monta&#539;i corespunz&#259;tor, problem&#259; care a fost &#238;ns&#259; remediat&#259; pentru versiunea destinat&#259; publicului larg. Demonstra&#539;iile f&#259;cute pe modelele beta constau &#238;n pornirea sistemului de operare Linux &#537;i rularea unui clip video 1080p.
<br><br><li><b>&#238;nceputul lui 2012</b> - &#206;n prima s&#259;pt&#259;m&#226;n&#259; a anului, primele 10 pl&#259;cu&#539;e au fost scoase la licita&#539;ie pe eBay. Una a fost cump&#259;rat&#259; de o persoan&#259; anonim&#259; &#537;i donat&#259; muzeului Centrului pentru Istoria Tehnicii de Calcul din Cambridge, Anglia. Cele 10 pl&#259;cu&#539;e au str&#226;ns &#238;n total 16000 de lire. Ultima pl&#259;cu&#539;&#259; scoas&#259; la licita&#539;ie a fost cea cu num&#259;rul serial 01, care a fost v&#226;ndut&#259; pentru 3500 de lire.
<br><br><br>

<h2>Lansarea:</h2>
<li><b>19 februarie 2012</b> - Prima versiune, cu scop demonstrativ, a unei imagini ce con&#539;inea sistemul de operare &#537;i care putea fi &#238;nc&#259;rcat&#259; pe un card SD a fost lansat&#259;. Imaginea era bazat&#259; pe Debian 6.0. Con&#539;inea, &#238;n plus, browser-ul Midori &#537;i c&#226;teva unelte de programare.
<br><br><li><b>29 februarie 2012</b> - Primele v&#226;nz&#259;ri &#238;ncep, la ora 06:00 UTC. Tot acum este anun&#539;at faptul ca Model A va avea 256 MB de meorie la lansare, &#238;n loc de 128 MB. Pentru v&#226;nzarea pl&#259;cu&#539;elor au fost ini&#539;ial licen&#539;ia&#539;i doi produc&#259;tori, Premier Farnell &#537;i RS Components. Ambele au avut probleme cu magazinele online din cauza traficului ce a ap&#259;rut imediat dup&#259; lansare. Se spune c&#259; peste dou&#259; milioane de persoane au f&#259;cut precomenzi, sau au manifestat m&#259;car interes pentru aceasta, &#238;n prima zi. Conform funda&#539;iei Raspberry, Premier Fernell &#537;i-a v&#226;ndut &#238;ntreg stocul &#238;n primele minute, iar la RS Components au fost plasate peste o sut&#259; de mii de comenzi &#238;n prima zi.
<br><br><li><b>martie 2012</b> - Din cauza unor defecte de fabricare legate de portul de Ethernet, au fost anun&#539;ate &#238;nt&#226;rzieri cu privire la data livr&#259;rii. Primele 10000 de pl&#259;cu&#539;e au fost fabricate &#238;n Taiwan &#537;i China.
<br><br><li><b>8 martie 2012</b> - Prima versiune a distribu&#539;iei Linux recomandate, Raspberry Pi Fedora Remix, este lansat&#259;. Aceasta a fost dezvoltat&#259; la Colegiul Seneca din Canada.
<br><br><br>

<h2>Dup&#259; lansare:</h2>
<br><br><li><b>16 aprilie 2012</b> - Primele computere sunt livrate.
<br><br><li><b>20 aprilie 2012</b> - Schemele pentru Model A &#537;i Model B sunt oferite publicului.
<br><br><li><b>18 mai 2012</b> - Funda&#539;ia raporteaz&#259; lucrul la un modul cu o camer&#259; foto-video. Prototipul avea un senzor de 14 megapixeli.
<br><br><li><b>22 mai 2012</b> - Peste 20000 de unit&#259;&#539;i au fost livrate.
<br><br><li><b>16 iulie 2012</b> - 4000 de unit&#259;&#539;i erau fabricate zilnic, ceea ce permitea v&#226;nzarea unor cantit&#259;&#539;i mai mari &#238;n fiecare comand&#259;.
<br><br><li><b>iulie 2012</b> - Raspbian este lansat.
<br><br><li><b>5 septembrie 2012</b> - Este anun&#539;at&#259; versiunea 2.0 a Model B, care urma s&#259; con&#539;in&#259; c&#226;teva &#238;mbun&#259;t&#259;&#539;iri minore.
<br><br><li><b>15 octombrie 2012</b> - Este anun&#539;at faptul c&#259; versiunea 2.0 a Model B va avea 512 MB de RAM, &#238;n loc de 256.
<br><br><li><b>octombrie 2012</b> - Sunt raportate &#238;nt&#226;rzieri de peste 6 luni pentru unele livr&#259;ri, de vin&#259; fiind subestim&#259;rile cu privire la num&#259;rul de v&#226;nz&#259;ri pe care distribuitorul &#238;n cauz&#259; le avea &#238;naintea lans&#259;rii.
<br><br><li><b>3 iunie 2013</b> - NOOBS este lansat, un program ce faciliteaz&#259; instalarea unui sistem de operare pe Raspberry Pi.
<br><br><li><b>octombrie 2013</b> - Funda&#539;ia anun&#539;&#259; c&#259; produsul cu num&#259;rul 1,000,000 a fost fabricat &#238;n Regatul Unit.
<br><br><li><b>noiembrie 2013</b> - Funda&#539;ia anun&#539;&#259; c&#259; &#238;ntre 24 &#537;i 31 octombrie a fost expediat computerul cu num&#259;rul 2,000,000.
<br><br><li><b>7 aprilie 2014</b> - Este anun&#539;at Modulul de Calcul Raspberry Pi, destinat folosirii de c&#259;tre proiectan&#539;ii de electronice &#238;n produsele lor.
<br><br><li><b>iunie 2014</b> - Funda&#539;ia anun&#539;&#259; c&#259; la &#238;nceputul lunii mai a fost v&#226;ndut computerul cu num&#259;rul 3,000,000.
<br><br><li><b>14 iulie 2014</b> - Este anun&#539;at Raspberry Pi Model B+, la acela&#537;i pre&#539; cu pl&#259;cu&#539;a original&#259;.
<br><br><li><b>10 noiembrie 2014</b> - Este anun&#539;at Raspberry Pi Model A+.
<br><br><li><b>2 februarie 2015</b> - Este anun&#539;at Raspberry Pi 2. Urmeaz&#259; s&#259; aib&#259; un procesor cu patru nuclee, cu 900 MHz, cantitate dubl&#259; de RAM (1 GB) &#537;i compatibilitate complet&#259; cu modelele anterioare.
<br><br><li><b>26 noiembrie 2015</b> - Funda&#539;ia lanseaz&#259; Raspberry Pi Zero, cel mai mic (65 mm * 30 mm) &#537;i mai ieftin (5 dolari) membru al familiei. Acesta a fost distribuit &#238;n mod gratuit, &#238;n prima zi, &#238;mpreun&#259; cu num&#259;rul 40 al revistei MagPI, ceea ce a cauzat epuizarea stocului revistei la distribuitorii din toat&#259; lumea.
<br><br><li><b>29 februarie 2016</b> - Este anun&#539;at Raspberry Pi 3, cu un procesor de 1.2 GHz, pe 64 de bi&#539;i, cu WiFi &#537;i Bluetooth integrate.
<br><br><li><b>februarie 2016</b> - Funda&#539;ia a anun&#539;at c&#259; au fost v&#226;ndute &#238;n total 8 milioane de computere, ajung&#226;nd astfel cel mai bine v&#226;ndut computer. P&#226;n&#259; &#238;n luna septembrie a acelui an, num&#259;rul avea s&#259; ajung&#259; la 10 milioane.
<br><br><li><b>25 aprilie 2016</b> - Este anun&#539;at&#259; camera Raspberry Pi Camera v2.1, de 8 Mpixeli, av&#226;nd &#537;i o versiune NoIR (cu infraro&#537;u).
<br><br><li><b>25 noiembrie 2016</b> - Au fost v&#226;ndute 11 milioane de unit&#259;&#539;i.
<br><br><li><b>16 ianuarie 2017</b> - Sunt lansate Modulele de Calcul 3 &#537;i 3 Lite.
<br><br><li><b>28 februarie 2017</b> - Raspberry Pi Zero W, cu WiFi &#537;i Bluetooth integrate, este lansat.
<p></p><br>
	<div style="text-align:center;">
	<div class="imgbox"><img src="alfa.jpg">-O versiune alfa, cu un design diferit de cel al modelului lansat publicului-</div>
	<div class="imgbox"><img src="modul.png">-Raspberry Pi Compute Module-</div>
</div>

</p>
</div>

<div class="bottomTransparent"></div></div>
<div class="bottomTransparent"></div>


</body>

</html>
