<!DOCTYPE html>
<html>
<head>

<link href="favicon.ico" rel="icon" type="image/x-icon" />

</head>

<title>Raspberry Pi - SOFTWARE - RO</title>

<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="library.css">

<body>

<div class="BGtitlu">

	<div class="topTransparent"></div>
	<div class="FGdark">

		<div class="ttransparent"></div>
		<a href="mainRO.html"><img src="titlu.png"></a>

		<a href="softRO.html"><div class="ribbonRO"><h2>RO</h2></div></a>
		<div class="triangleRO"></div>

		<a href="softEN.html"><div class="ribbonEN"><h2>EN</h2></div></a>
		<div class="triangleEN"></div>

	</div>

</div>

<div class="BGmeniu"><div class="FGdarkmeniu">

<a href="mainRO.html"><div class="menuTab" align="center">Home</div></a>
<a href="generalRO.html"><div class="menuTab" align="center">Generalit&#259;&#355;i</div></a>
<a href="istoricRO.html"><div class="menuTab" align="center">Istoric</div></a>
<a href="hardRO.html"><div class="menuTab" align="center">Hardware</div></a>
<a href="softRO.html"><div class="menuTabSelected" align="center">Software</div></a>
<a href="useRO.html"><div class="menuTab" align="center">Utiliz&#259;ri</div></a>
<a href="contactRO.html"><div class="menuTab" align="center">Contact</div></a>

</div></div>

<div class="FGdarkcontent"><div class="ccontent2" style="color: rgb(255, 255, 255)">

	Funda&#539;ia Raspberry Pi recomanda folosirea Raspbian, un sistem de operarea bazat pe Debian, construit pe arhitectura Linux. Alte sisteme de operare de la p&#259;r&#539;i ter&#539;e sunt disponibile pe website-ul oficial &#537;i includ Ubuntu MATE, Snappy Ubuntu Core, Windows 10 IoT Core, RISC OS &#537;i distribu&#539;ii specializate fie pentru sisteme media Kodi, fie pentru administrarea claselor de elevi. Exist&#259; &#238;ns&#259; multe alte sisteme de operare.
	<br><br>
	<h2>Sisteme de operare</h2>

	<b>Sisteme de operare care nu se bazeaz&#259; pe Linux:</b>
	<li>RISC OS Pi
	<li>FreeBSD
	<li>NetBSD
	<li>Plan 9
	<li>Windows 10 IoT Core - o versiune gratuit&#259; a Windows 10, oferit&#259; de Microsoft &#537;i care ruleaz&#259; nativ pe Raspberry Pi 2
	<li>Haiku
	<li>HelenOS - sistem de operare pentru servere
	<li>Genode OS

		<br><br>

	<b>Sisteme de operare care se bazeaz&#259; pe Linux:</b>
	<li>Android Things - o versiune a sistemului de operare Android, construit&#259; pentru dispozitive IoT (Internet of Things)
	<li>Arch Linux ARM - o portare a sistemului de operare Arch Linux, pentru procesoare ARM
	<li>Xbian - folosind centrul media digital Kodi
	<li>openSUSE
	<li>Raspberry Pi Fedora Remix
	<li>Pidora - alternativ&#259; a sistemului de operare Fedora Remix, optimizat pentru Raspberry Pi
	<li>Gentoo Linux
	<li>Diet Pi - include o serie de servere pentru media, VPN, Minecraft &#537;i multe altele
	<li>CentOS - pentru Raspberry Pi 2 &#537;i modelele ulterioare
	<li>RedSleeve
	<li>Slackware Arm
	<li>Moebius
	<li>OpenWrt - folosit &#238;n aplica&#539;ii incorporate pentru a direc&#539;iona traficul din re&#539;ele
	<li>Kali Linux - este bazat pe Debian &#537;i este folosit pentru teste de securitate
	<li>SolydXK
	<li>Pardus ARM
	<li>Instan WebKiosk
	<li>Ark OS - folosit pentru g&#259;zduire de site-uri &#537;i adrese de email
	<li>ROKOS - bazat pe Raspbian &#537;i folosit pentru administrare de criptovalut&#259;, cum sunt Bitcoin &#537;i OKCash
	<li>Kano OS
	<li>Nard SDK - pentru proiectare de sisteme integrate de nivel industrial
	<li>Sailfish OS
	<li>Tiny Core Linux
	<li>IPFire - pentru securitatea re&#539;elelor de mici dimensiuni
	<li>Alpine Linux
	<li>Void Linux
	<li>Tingbot OS
	<li>WTware pentru Raspberry pi
	<li>Puppy Linux
	<li>Fedora 25 - pentru Raspberry Pi 2 &#537;i modelele ulterioare
	<li>Sisteme de operare pentru sisteme media: OSMC, OpenELEC, Xbian, Rasplex
	<li>Sisteme de operare pentru operare audio: Volumio, Pimusicbox, Runeaudio
	<li>Sisteme de operare pentru "retrogaming": Retropie, Recalbox, Lakka, Piplay, ChameleonPi

<br><br>

	<h2>API-uri pentru drivere</h2>
	Raspberry Pi &#238;&#537;i poate folosi procesorul grafic VideoCore IV GPU printr-o secven&#539;&#259; de cod binar &#238;nc&#259;rcat&#259; pe GPU la pornire de pe cardul SD, dar &#537;i prin alte programe. Aceast&#259; ultim&#259; parte era ini&#539;ial de tip closed source, &#238;ns&#259; mai t&#226;rziu a fost oferit&#259; publicului. Cu toate acestea, mare parte din opera&#539;ii sunt &#238;nc&#259; f&#259;cute prin cod de tip closed-source. Aplica&#539;iile trebuie s&#259; apeleze libr&#259;riile OpenMax, OpenGL ES sau OpenVG, care la r&#226;ndul lor sunt de tip close-source &#537;i care apeleaz&#259; la r&#226;ndul lor un driver de tip open-source al sistemului de operare Linux. Abia acesta apeleaz&#259; codul driver al GPU-ului VideoCore IV. Aplica&#539;iile video folosesc OpenMAX, aplica&#539;iile 3D folosesc OpenGL ES, iar cele 2D folosesc OpenVG, ambele folosind la r&#226;ndul lor EGL.
<br><br>
	<h2>Firmware</h2>
	Firmware-ul oficial poate fi redistribuit liber, &#238;ns&#259; este closed-source. Un firmware minimal open-source este, de asemenea, disponibil.
<br><br>
	<h2>Aplica&#539;ii de la p&#259;r&#539;i ter&#539;e</h2>
	<li>AstroPrint - programul pentru print&#259;ri 3D poate fi folosit pe Raspbarry Pi 2 &#537;i pe modelele ulterioare
	<li>C/C++ Interpreter CH - lansat pe 3 ianuarie 2017, este un program pentru utilizare necomercial&#259;
	<li>Mathematica &#537;i limbajul Wolfram - din 21 noiembrie 2013, Raspbian include o versiune integral&#259; &#537;i gratuit&#259; a acestuia
	<li>Minecraft - lansat&#259; pe 11 februarie 2013, o versiune pentru Raspberry Pi, &#238;n care po&#539;i modifica lumea din joc prin intermediul codului, singura versiune oficial&#259; a jocului &#238;n care se poate face asta
	<li>RealVNC - din 28 septembrie 2016, Raspbian include programul de accesare &#537;i vizualizare a con&#539;inutului de pe servere de la RealVNC
	<li>UserGate Web Filter
<br><br>
	<h2>Unelte pentru dezvoltare software:</h2>
	<li>Arduino IDE
	<li>Algoid - pentru a &#238;nv&#259;&#539;a programare, destinat copiilor &#537;i &#238;ncep&#259;torilor
	<li>BlueJ - pentru a &#238;nv&#259;&#539;a Java, destinat &#238;ncep&#259;torilor
	<li>Fawlty Language
	<li>Greenfoot - ajut&#259; la &#238;nv&#259;&#539;area program&#259;rii orientat&#259; pe obiecte, cu Java
	<li>Julia
	<li>Lazarus - un IDE gratuit pentru Pascal
	<li>LiveCode
	<li>Ninja-IDE - un IDE pentru Python
	<li>Object Pascal
	<li>Processing
	<li>Scratch - pentru a &#238;nv&#259;&#539;a programare, cu o interfa&#539;&#259; grafic&#259;
	<li>Squeak Smalltalk
	<li>V-Play Game Engine
	<li>Xojo
	<li>PowerBerry
	<li>C-STEM Studio

</p>
</div>

<div class="bottomTransparent"></div></div>
<div class="bottomTransparent"></div>


</body>

</html>
