<!DOCTYPE html>
<html>
<head>

<link href="favicon.ico" rel="icon" type="image/x-icon" />

</head>

<title>Raspberry Pi - UTILIZ&#258;RI - RO</title>

<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="library.css">

<body>

<div class="BGtitlu">

	<div class="topTransparent"></div>
	<div class="FGdark">

		<div class="ttransparent"></div>
		<a href="mainRO.html"><img src="titlu.png"></a>

		<a href="useRO.html"><div class="ribbonRO"><h2>RO</h2></div></a>
		<div class="triangleRO"></div>

		<a href="useEN.html"><div class="ribbonEN"><h2>EN</h2></div></a>
		<div class="triangleEN"></div>

	</div>

</div>

<div class="BGmeniu"><div class="FGdarkmeniu">

<a href="mainRO.html"><div class="menuTab" align="center">Home</div></a>
<a href="generalRO.html"><div class="menuTab" align="center">Generalit&#259;&#355;i</div></a>
<a href="istoricRO.html"><div class="menuTab" align="center">Istoric</div></a>
<a href="hardRO.html"><div class="menuTab" align="center">Hardware</div></a>
<a href="softRO.html"><div class="menuTab" align="center">Software</div></a>
<a href="useRO.html"><div class="menuTabSelected" align="center">Utiliz&#259;ri</div></a>
<a href="contactRO.html"><div class="menuTab" align="center">Contact</div></a>

</div></div>

<div class="FGdarkcontent"><div class="ccontent2" style="color: rgb(255, 255, 255)">

	Comunitatea Raspberry Pi a fost descris&#259; de Jamie Ayre drept una dintre cele mai frumoase p&#259;r&#539;i ale proiectului. Bloggerul Russel Davis a spus c&#259; puterea oferit&#259; de comunitate &#238;i permite Funda&#539;iei s&#259; se concentreze pe documenta&#539;ie &#537;i pe educa&#539;ie.
	<br><br>Comunitatea a creat o revist&#259; dedicat&#259; fanilor, numit&#259; MagPi, care a fost transferat&#259; c&#259;tre Funda&#539;ia Raspberry Pi de c&#259;tre voluntari, pentru a fi continuat&#259; de aceasta. O serie de evnimente dedicate computerului au fost &#539;inute &#238;n Regatul Unit &#537;i &#238;n restul lumii, numite Raspberry Jam.

<br><br>

<h2>Utiliz&#259;ri &#238;n educa&#539;ie</h2>
&#206;n ianuarie 2012, interes pentru computer a venit at&#226;t din partea &#537;colilor publice din Regatul Unit, c&#226;t &#537;i din a celor private, &#238;n propor&#539;ie de aproximativ 1:5. Se spera c&#259; diferite companii vor sponsoriza achizi&#539;ionarea omputerelor pentru &#537;colile dezavantajate din punct de vedere economic. Pre&#537;edintele Premier Farnell a precizat c&#259; guvernul unei &#539;&#259;ri din Orientul Mijlociu a manifestat interes pentru asigurarea c&#226;te unui astfel de computer pentru fiecare elev&#259;, pentru a le &#238;mbun&#259;t&#259;&#539;i &#537;ansele de angajare.
<br><br>
&#206;n 2014, Funda&#539;ia a angajat c&#226;&#539;iva membri ai comunit&#259;&#539;ii, inclusiv fo&#537;ti profesori &#537;i dezvoltatori de programe, pentru a lansa un set de resurse gratuite de &#238;nv&#259;&#539;are pe website-ul acesteia. Resursele sunt acum dispnibile sub licen&#539;&#259; gratuit&#259;, iar contribu&#539;ii &#537;i colbor&#259;ri sunt &#238;ncurajate pe platforma de programare social&#259; GitHub.
<br><br>
Funda&#539;ia a &#238;nceput &#537;i un curs pentru preg&#259;tirea profesorilor, numit Picademy cu scopul de a-i ajuta pe profesori s&#259; predea noul curriculum de programare folosind computerul Raspberry Pi &#238;n clase. Acest curs este oferit gratuit profesorilor &#537;i este condus de echipa educa&#539;ional&#259; a Funda&#539;iei.
&#206;n ianuarie 2017, un curs gratuit a fost lansat pe Kadenze, &#238;n colaborare cu Universitatea din New South Wales, din Sydney, Australia, pe tema IoT, folosind Raspberry Pi. De asemenea, multe resurse utile se pot g&#259;si pe site-urile Funda&#539;iei &#537;i pe Sparkfun.
<br><br>
<h2>Utiliz&#259;ri &#238;n automatizarea casei</h2>
Exist&#259; un num&#259;r de dezvoltatori de aplica&#539;ii care folosesc computerul Raspberry Pi pentru automatizarea casei. Ace&#537;tia depun eforturi pentru a realiza o solu&#539;ie accesibil&#259; pentru monitorizarea consumului de energie. Datorit&#259; costului relativ redus al computerului, acesta a devenit o alternativ&#259; la solu&#539;iile comerciale mai scumpe.
<br><br>
<h2>Utiliz&#259;ri &#238;n automatiz&#259;ri industriale</h2>
&#206;n iunie 2014, TECHBASE, o companie polonez&#259; care se ocup&#259; cu automatiz&#259;ri industriale, a dezvoltat primul computer industrial bazat pe un Modul de Calcul Raspberry Pi, numit ModBerry. Dispozitivul are numeroase interfe&#539;e, porturi serial &#537;i canale de input/output at&#226;t digitale, c&#226;t &#537;i analog. Designul permite folosirea Modulului de Calcul &#238;n medii industriale neprietenoase, ceea ce &#238;nseamn&#259; c&#259; Raspberry Pi nu mai este limitat doar la proiecte casnice &#537;i &#537;tiin&#539;ifice, dar poate fi folosit ca o solu&#539;ie IoT industrial&#259;.
<br><br>
<h2>Utiliz&#259;ri &#238;n produse comerciale</h2>
OTTO este o camer&#259; digital&#259; creat&#259; de compania Next Thing. Folose&#537;te Modulul de Calcul Raspberry Pi &#537;i a fost finan&#539;at&#259; &#238;n comun &#238;n mai 2014, &#238;ntr-o campanie Kickstarter.
<br><br>Slice este un media player digital care folose&#537;te acela&#537;i modul. A fost finan&#539;at&#259; &#238;n aceea&#537;i manier&#259;, &#238;n august 2014. Software-ul de pe acesta se bazeaz&#259; pe Kodi.

</p>
</div>

<div class="bottomTransparent"></div></div>
<div class="bottomTransparent"></div>


</body>

</html>
